special.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Policy on Extra-Ordinary Treatment</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-07-04 23:18:24 IDT"/>
<meta name="author" content="Mayer Goldberg"/>
<meta name="description" content=""/>
<meta name="keywords" content="Mayer Goldberg, Department of Computer Science, Ben-Gurion University, Software Engineering, courses, compiler construction, advanced programming languages, principles of programming languages, APL, PPL"/>

</head>
<body>
<div id="content">

<h1 class="title">Policy on Extra-Ordinary Treatment</h1>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 General policy </a></li>
<li><a href="#sec-2">2 Circumstances recognized by the university </a></li>
<li><a href="#sec-3">3 Extensions or exemptions for any other reasons </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> General policy </h2>
<div class="outline-text-2" id="text-1">


<p>
There are no extensions, exemptions, or extra-ordinary treatment in my
courses, for any circumstances other than mandated by the university
or by the head of the teaching committee. I expect all coursework to
be handed in by the deadline. There is a late penalty of 5% per day,
compounded daily, for late work. This is the in-class remedy for all
your special circumstances: You are responsible for deciding how much
of this late-penalty you can afford. I repeat: This penalty covers <i>all</i>
extra-ordinary situations that are not mandated by the university or
the head of the teaching committee.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Circumstances recognized by the university </h2>
<div class="outline-text-2" id="text-2">


<ul>
<li>The university recognizes precisely two situations for which an
  exemption (פטור) from homework is given: A medical condition that
  requires hospitalization, and reserve duty (מילואים). If this is
  your situation, you must submit official documentation to that
  effect, listing the dates you were hospitalized or served in the
  reserve. The preferred way to notify us is to scan your supporting
  documentation, and mail it to your TA. 

</li>
<li>If your hospitalization or reserve duty take place during a quiz,
  you should provide documentation, as above, to your TA.
</li>
<li>If your hospitalization or reserve duty take place during the final project, then -
<ul>
<li>If you are a student in the <i>Computer Science</i> (CS) program, then
    you should <a href="mailto:gmayer@little-lisper.org">contact me via email</a> as soon as you can,
    with scans of your supporting documentation, and we shall notify
    you of any extensions you may receive.
</li>
<li>If you are a student in the <i>Software Engineering</i> (SE) program,
    then you must contact the chairperson of the SE teaching committee
    with your documentation, and they shall notify us of any
    extensions you may receive.
</li>
</ul>
</li>
</ul>

<p>
If you receive an exemption, your final grade shall be computed using
the remaining components of your coursework out of the remaining
number of points. For example, if you become exempt from a component
that carries a weight of 20 points of your final grade, then the
remaining components shall maintain their weight out of a total of 80
points.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Extensions or exemptions for any other reasons </h2>
<div class="outline-text-2" id="text-3">


<p>
If the university does not recognize your specific circumstances as
meriting special treatment, than neither do I. Please do not explain
your special circumstances to me, but rather appeal to the head of the
teaching committee, and we shall, of course, abide by his or her
decision.
</p></div>
</div>
<div id="postamble">
<p class="author">Author: Mayer Goldberg</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
